; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	image0 - mode
	thermograph2 - mode
	thermograph1 - mode
	infrared3 - mode
	Star4 - direction
	Star8 - direction
	GroundStation10 - direction
	Star13 - direction
	GroundStation16 - direction
	Star19 - direction
	GroundStation20 - direction
	GroundStation21 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star18 - direction
	GroundStation9 - direction
	Star15 - direction
	GroundStation22 - direction
	Star6 - direction
	GroundStation17 - direction
	Star7 - direction
	GroundStation12 - direction
	GroundStation2 - direction
	GroundStation11 - direction
	GroundStation14 - direction
	Star24 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star23 - direction
	Planet25 - direction
	Planet26 - direction
	Planet27 - direction
	Planet28 - direction
	Planet29 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
	Star32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Planet35 - direction
	Planet36 - direction
	Phenomenon37 - direction
	Star38 - direction
	Phenomenon39 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation17)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation22)
	(calibration_target instrument2 Star15)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet27)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation20)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star23)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star24)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 GroundStation11)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation14)
	(have_image Planet25 image0)
	(have_image Planet26 thermograph1)
	(have_image Planet27 thermograph1)
	(have_image Planet28 thermograph2)
	(have_image Planet29 thermograph2)
	(have_image Phenomenon30 infrared3)
	(have_image Phenomenon31 infrared3)
	(have_image Star32 thermograph2)
	(have_image Planet33 thermograph1)
	(have_image Phenomenon34 thermograph1)
	(have_image Planet35 thermograph2)
	(have_image Planet36 image0)
	(have_image Phenomenon37 thermograph2)
	(have_image Star38 image0)
	(have_image Phenomenon39 infrared3)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 16
2. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 16
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
4. (turn_to satellite2 phenomenon34 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon34)
   goals met: 0 of 16
5. (take_image satellite2 phenomenon34 instrument4 thermograph1)
   added: (have_image phenomenon34 thermograph1)
   goals met: 1 of 16
6. (turn_to satellite2 phenomenon37 phenomenon34)
   deleted: (pointing satellite2 phenomenon34)
   added: (pointing satellite2 phenomenon37)
   goals met: 1 of 16
7. (take_image satellite2 phenomenon37 instrument4 thermograph2)
   added: (have_image phenomenon37 thermograph2)
   goals met: 2 of 16
8. (turn_to satellite2 planet25 phenomenon37)
   deleted: (pointing satellite2 phenomenon37)
   added: (pointing satellite2 planet25)
   goals met: 2 of 16
9. (take_image satellite2 planet25 instrument4 image0)
   added: (have_image planet25 image0)
   goals met: 3 of 16
10. (turn_to satellite2 planet26 planet25)
   deleted: (pointing satellite2 planet25)
   added: (pointing satellite2 planet26)
   goals met: 3 of 16
11. (take_image satellite2 planet26 instrument4 thermograph1)
   added: (have_image planet26 thermograph1)
   goals met: 4 of 16
12. (turn_to satellite2 planet27 planet26)
   deleted: (pointing satellite2 planet26)
   added: (pointing satellite2 planet27)
   goals met: 4 of 16
13. (take_image satellite2 planet27 instrument4 thermograph1)
   added: (have_image planet27 thermograph1)
   goals met: 5 of 16
14. (turn_to satellite2 planet28 planet27)
   deleted: (pointing satellite2 planet27)
   added: (pointing satellite2 planet28)
   goals met: 5 of 16
15. (take_image satellite2 planet28 instrument4 thermograph2)
   added: (have_image planet28 thermograph2)
   goals met: 6 of 16
16. (turn_to satellite2 planet29 planet28)
   deleted: (pointing satellite2 planet28)
   added: (pointing satellite2 planet29)
   goals met: 6 of 16
17. (take_image satellite2 planet29 instrument4 thermograph2)
   added: (have_image planet29 thermograph2)
   goals met: 7 of 16
18. (turn_to satellite2 planet33 planet29)
   deleted: (pointing satellite2 planet29)
   added: (pointing satellite2 planet33)
   goals met: 7 of 16
19. (take_image satellite2 planet33 instrument4 thermograph1)
   added: (have_image planet33 thermograph1)
   goals met: 8 of 16
20. (turn_to satellite2 planet35 planet33)
   deleted: (pointing satellite2 planet33)
   added: (pointing satellite2 planet35)
   goals met: 8 of 16
21. (take_image satellite2 planet35 instrument4 thermograph2)
   added: (have_image planet35 thermograph2)
   goals met: 9 of 16
22. (turn_to satellite2 planet36 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 planet36)
   goals met: 9 of 16
23. (take_image satellite2 planet36 instrument4 image0)
   added: (have_image planet36 image0)
   goals met: 10 of 16
24. (turn_to satellite2 star32 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 star32)
   goals met: 10 of 16
25. (take_image satellite2 star32 instrument4 thermograph2)
   added: (have_image star32 thermograph2)
   goals met: 11 of 16
26. (turn_to satellite2 star38 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 star38)
   goals met: 11 of 16
27. (take_image satellite2 star38 instrument4 image0)
   added: (have_image star38 image0)
   goals met: 12 of 16
28. (turn_to satellite0 groundstation14 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 groundstation14)
   goals met: 13 of 16
29. (turn_to satellite0 groundstation5 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 groundstation5)
   goals met: 12 of 16
30. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 12 of 16
31. (turn_to satellite0 groundstation14 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation14)
   goals met: 13 of 16
32. (turn_to satellite0 phenomenon30 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon30)
   goals met: 12 of 16
33. (take_image satellite0 phenomenon30 instrument0 infrared3)
   added: (have_image phenomenon30 infrared3)
   goals met: 13 of 16
34. (turn_to satellite0 groundstation14 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 groundstation14)
   goals met: 14 of 16
35. (turn_to satellite0 phenomenon31 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon31)
   goals met: 13 of 16
36. (take_image satellite0 phenomenon31 instrument0 infrared3)
   added: (have_image phenomenon31 infrared3)
   goals met: 14 of 16
37. (turn_to satellite0 groundstation14 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 groundstation14)
   goals met: 15 of 16
38. (turn_to satellite0 phenomenon39 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon39)
   goals met: 14 of 16
39. (take_image satellite0 phenomenon39 instrument0 infrared3)
   added: (have_image phenomenon39 infrared3)
   goals met: 15 of 16
40. (turn_to satellite0 groundstation14 phenomenon39)
   deleted: (pointing satellite0 phenomenon39)
   added: (pointing satellite0 groundstation14)
   goals met: 16 of 16
